---
kind: method
id: M:Autodesk.Revit.DB.FamilyInstance.rotate
zh: 旋转
source: html/634dc711-7d00-a176-9c61-c53c27c89849.htm
---
# Autodesk.Revit.DB.FamilyInstance.rotate Method

**中文**: 旋转

The family instance will be flipped by 180 degrees. If it can not be rotated, return false, otherwise return true.

## Syntax (C#)
```csharp
public bool rotate()
```